## Production: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 0 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_route53_record.amazonses-inbound-notification-canada-ca-MX[0]`                                 |
|        | `aws_route53_record.amazonses-mail-from-notification-canada-ca-MX[0]`                               |
|        | `aws_route53_record.amazonses-mail-from-notification-canada-ca-TXT[0]`                              |
|        | `aws_route53_record.amazonses-notification-canada-ca-TXT[0]`                                        |
|        | `aws_route53_record.api-notification-canada-ca-ACM-cname[0]`                                        |
|        | `aws_route53_record.assets-notification-canada-ca-ACM-cname[0]`                                     |
|        | `aws_route53_record.assets-notification-canada-ca-cname[0]`                                         |
|        | `aws_route53_record.document-notification-canada-ca-ACM-cname[0]`                                   |
|        | `aws_route53_record.notification-canada-ca-ACM-cname[0]`                                            |
|        | `aws_route53_record.notification-canada-ca-DMARC[0]`                                                |
|        | `aws_route53_record.notification-canada-ca-SPF[0]`                                                  |
|        | `aws_route53_zone.notification-canada-ca[0]`                                                        |
| delete | `aws_ses_domain_dkim.custom_sending_domains[&quot;core-ocre.gc.ca&quot;]`                                     |
|        | `aws_ses_domain_dkim.custom_sending_domains[&quot;international.gc.ca&quot;]`                                 |
|        | `aws_ses_domain_identity.custom_sending_domains[&quot;core-ocre.gc.ca&quot;]`                                 |
|        | `aws_ses_domain_identity.custom_sending_domains[&quot;international.gc.ca&quot;]`                             |
|        | `aws_ses_domain_mail_from.custom_sending_domains[&quot;core-ocre.gc.ca&quot;]`                                |
|        | `aws_ses_domain_mail_from.custom_sending_domains[&quot;international.gc.ca&quot;]`                            |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic[&quot;core-ocre.gc.ca&quot;]`        |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic[&quot;international.gc.ca&quot;]`    |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic[&quot;core-ocre.gc.ca&quot;]`     |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic[&quot;international.gc.ca&quot;]` |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic[&quot;core-ocre.gc.ca&quot;]`      |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic[&quot;international.gc.ca&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.amazonses-inbound-notification-canada-ca-MX[0] will be created
  + resource "aws_route53_record" "amazonses-inbound-notification-canada-ca-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "notification.canada.ca"
      + records         = [
          + "10 inbound-smtp.us-east-1.amazonaws.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.amazonses-mail-from-notification-canada-ca-MX[0] will be created
  + resource "aws_route53_record" "amazonses-mail-from-notification-canada-ca-MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.notification.canada.ca"
      + records         = [
          + "10 feedback-smtp.ca-central-1.amazonses.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.amazonses-mail-from-notification-canada-ca-TXT[0] will be created
  + resource "aws_route53_record" "amazonses-mail-from-notification-canada-ca-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bounce.notification.canada.ca"
      + records         = [
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.amazonses-notification-canada-ca-TXT[0] will be created
  + resource "aws_route53_record" "amazonses-notification-canada-ca-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.notification.canada.ca"
      + records         = [
          + "FHX+PBM3ip2HfDeSXs3WpEuQZydluvX9VpOdBKj0dgU=",
          + "Ohfl/Syh3ZT5U/7IKELTCXIRaqI42ZJiw0HiUQoCHww=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.api-notification-canada-ca-ACM-cname[0] will be created
  + resource "aws_route53_record" "api-notification-canada-ca-ACM-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_902cdb1a2cb8214fc698261ee3085b64.api.notification.canada.ca"
      + records         = [
          + "_ac309158c158035bfb929da1617e2b16.mqzgcdqkwq.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.assets-notification-canada-ca-ACM-cname[0] will be created
  + resource "aws_route53_record" "assets-notification-canada-ca-ACM-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_4e30c74d7459e0d63bdcdaac7a57fdcf.assets.notification.canada.ca"
      + records         = [
          + "_2da9b84f7e094fd64c8930cffe8d9842.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.assets-notification-canada-ca-cname[0] will be created
  + resource "aws_route53_record" "assets-notification-canada-ca-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "assets.notification.canada.ca"
      + records         = [
          + "d1spq0ojswv1dj.cloudfront.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.document-notification-canada-ca-ACM-cname[0] will be created
  + resource "aws_route53_record" "document-notification-canada-ca-ACM-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_db43d1cf891afd4671fb913d18ef0a0e.document.notification.canada.ca"
      + records         = [
          + "_130ea19fa1fdd9e59b7632fbac0d7e00.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.notification-canada-ca-ACM-cname[0] will be created
  + resource "aws_route53_record" "notification-canada-ca-ACM-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_2115a5004ab7895234c60254e152046b.notification.canada.ca"
      + records         = [
          + "_aaacd89cd470de0970c70c7ab1b7d4d5.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.notification-canada-ca-DMARC[0] will be created
  + resource "aws_route53_record" "notification-canada-ca-DMARC" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.notification.canada.ca"
      + records         = [
          + "v=DMARC1; p=reject; sp=reject; pct=100; rua=mailto:dmarc@cyber.gc.ca",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.notification-canada-ca-SPF[0] will be created
  + resource "aws_route53_record" "notification-canada-ca-SPF" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "notification.canada.ca"
      + records         = [
          + "google-site-verification=KMFWVel40xicbDXojkXz_1B2gBlPFSqF69cVdH_dfn0",
          + "google-site-verification=WNq0Z6naWk2E9SfS9eYq6Y6ZHH29nmkgox3chj5I9iE",
          + "v=spf1 include:amazonses.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.notification-canada-ca[0] will be created
  + resource "aws_route53_zone" "notification-canada-ca" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "notification.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_ses_domain_dkim.custom_sending_domains["core-ocre.gc.ca"] will be destroyed
  # (because key ["core-ocre.gc.ca"] is not in for_each map)
  - resource "aws_ses_domain_dkim" "custom_sending_domains" {
      - dkim_tokens = [
          - "xb26e7x7zf63n6mgldneyt6qtyrom4kp",
          - "vixorxpiohpgqnwonqs7frgu4vutxb45",
          - "sudxpvj3xnbkhhzprggpffgvzgogsbnr",
        ] -> null
      - domain      = "core-ocre.gc.ca" -> null
      - id          = "core-ocre.gc.ca" -> null
    }

  # aws_ses_domain_dkim.custom_sending_domains["international.gc.ca"] will be destroyed
  # (because key ["international.gc.ca"] is not in for_each map)
  - resource "aws_ses_domain_dkim" "custom_sending_domains" {
      - dkim_tokens = [
          - "uqkhwpwzr4kfjyjbate25hmfxwyz3tnf",
          - "fgjqc5ulpwygri2llzsumuigtxmegilv",
          - "rrlmuq54us36jnnkwdn77u3ztdomdb23",
        ] -> null
      - domain      = "international.gc.ca" -> null
      - id          = "international.gc.ca" -> null
    }

  # aws_ses_domain_identity.custom_sending_domains["core-ocre.gc.ca"] will be destroyed
  # (because key ["core-ocre.gc.ca"] is not in for_each map)
  - resource "aws_ses_domain_identity" "custom_sending_domains" {
      - arn                = "arn:aws:ses:ca-central-1:296255494825:identity/core-ocre.gc.ca" -> null
      - domain             = "core-ocre.gc.ca" -> null
      - id                 = "core-ocre.gc.ca" -> null
      - verification_token = "hHJk8ccCqVZRloHXjleT6eFUvVfNylPv8LRGex+bbeU=" -> null
    }

  # aws_ses_domain_identity.custom_sending_domains["international.gc.ca"] will be destroyed
  # (because key ["international.gc.ca"] is not in for_each map)
  - resource "aws_ses_domain_identity" "custom_sending_domains" {
      - arn                = "arn:aws:ses:ca-central-1:296255494825:identity/international.gc.ca" -> null
      - domain             = "international.gc.ca" -> null
      - id                 = "international.gc.ca" -> null
      - verification_token = "bLMiTSbLxdqRRnMlIhVLVDuke+4DH0k8nl/mMOjYi4k=" -> null
    }

  # aws_ses_domain_mail_from.custom_sending_domains["core-ocre.gc.ca"] will be destroyed
  # (because key ["core-ocre.gc.ca"] is not in for_each map)
  - resource "aws_ses_domain_mail_from" "custom_sending_domains" {
      - behavior_on_mx_failure = "UseDefaultValue" -> null
      - domain                 = "core-ocre.gc.ca" -> null
      - id                     = "core-ocre.gc.ca" -> null
      - mail_from_domain       = "bounce.core-ocre.gc.ca" -> null
    }

  # aws_ses_domain_mail_from.custom_sending_domains["international.gc.ca"] will be destroyed
  # (because key ["international.gc.ca"] is not in for_each map)
  - resource "aws_ses_domain_mail_from" "custom_sending_domains" {
      - behavior_on_mx_failure = "UseDefaultValue" -> null
      - domain                 = "international.gc.ca" -> null
      - id                     = "international.gc.ca" -> null
      - mail_from_domain       = "bounce.international.gc.ca" -> null
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic["core-ocre.gc.ca"] will be destroyed
  # (because key ["core-ocre.gc.ca"] is not in for_each map)
  - resource "aws_ses_identity_notification_topic" "custom_sending_domains_bounce_topic" {
      - id                       = "core-ocre.gc.ca|Bounce" -> null
      - identity                 = "core-ocre.gc.ca" -> null
      - include_original_headers = false -> null
      - notification_type        = "Bounce" -> null
      - topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic["international.gc.ca"] will be destroyed
  # (because key ["international.gc.ca"] is not in for_each map)
  - resource "aws_ses_identity_notification_topic" "custom_sending_domains_bounce_topic" {
      - id                       = "international.gc.ca|Bounce" -> null
      - identity                 = "international.gc.ca" -> null
      - include_original_headers = false -> null
      - notification_type        = "Bounce" -> null
      - topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic["core-ocre.gc.ca"] will be destroyed
  # (because key ["core-ocre.gc.ca"] is not in for_each map)
  - resource "aws_ses_identity_notification_topic" "custom_sending_domains_complaint_topic" {
      - id                       = "core-ocre.gc.ca|Complaint" -> null
      - identity                 = "core-ocre.gc.ca" -> null
      - include_original_headers = false -> null
      - notification_type        = "Complaint" -> null
      - topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic["international.gc.ca"] will be destroyed
  # (because key ["international.gc.ca"] is not in for_each map)
  - resource "aws_ses_identity_notification_topic" "custom_sending_domains_complaint_topic" {
      - id                       = "international.gc.ca|Complaint" -> null
      - identity                 = "international.gc.ca" -> null
      - include_original_headers = false -> null
      - notification_type        = "Complaint" -> null
      - topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic["core-ocre.gc.ca"] will be destroyed
  # (because key ["core-ocre.gc.ca"] is not in for_each map)
  - resource "aws_ses_identity_notification_topic" "custom_sending_domains_delivery_topic" {
      - id                       = "core-ocre.gc.ca|Delivery" -> null
      - identity                 = "core-ocre.gc.ca" -> null
      - include_original_headers = false -> null
      - notification_type        = "Delivery" -> null
      - topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic["international.gc.ca"] will be destroyed
  # (because key ["international.gc.ca"] is not in for_each map)
  - resource "aws_ses_identity_notification_topic" "custom_sending_domains_delivery_topic" {
      - id                       = "international.gc.ca|Delivery" -> null
      - identity                 = "international.gc.ca" -> null
      - include_original_headers = false -> null
      - notification_type        = "Delivery" -> null
      - topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
    }

Plan: 12 to add, 0 to change, 12 to destroy.

Changes to Outputs:
  ~ custom_sending_domains_dkim  = [
      - {
          - domain = "core-ocre.gc.ca"
          - token  = "xb26e7x7zf63n6mgldneyt6qtyrom4kp"
        },
      - {
          - domain = "core-ocre.gc.ca"
          - token  = "vixorxpiohpgqnwonqs7frgu4vutxb45"
        },
      - {
          - domain = "core-ocre.gc.ca"
          - token  = "sudxpvj3xnbkhhzprggpffgvzgogsbnr"
        },
      - {
          - domain = "international.gc.ca"
          - token  = "uqkhwpwzr4kfjyjbate25hmfxwyz3tnf"
        },
      - {
          - domain = "international.gc.ca"
          - token  = "fgjqc5ulpwygri2llzsumuigtxmegilv"
        },
      - {
          - domain = "international.gc.ca"
          - token  = "rrlmuq54us36jnnkwdn77u3ztdomdb23"
        },
        {
            domain = "notification.gov.bc.ca"
            token  = "pypemga4ooemc3thf5h4p6jpcv5ieme2"
        },
        # (5 unchanged elements hidden)
    ]
  + production_route_53_zone_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca[0]"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
